Repository: albanobattistella/timetable
Catalog: help/*/*.po
Languages: de

source: Create classes and start with your timetable
de: Klassen anlegen und Stundenplan eintragen

source: The classes are written in the small text field of the day matrix. In the larger field you write the topic of the lesson. The entered classname is repeated every week starting from the date you created it, so you have to transfer your timetable only in the first week of school. If you change the entry to something different, <em>this changed class</em> is repeated from now on. To end repetition, you delete the entry (=string "") at the first date where it should appear no more.
de: Die Klassen werden in dem kleineren Textfeld eingetragen, welches sich im Tagesraster befindet.Im größeren Textfeld trägt man das Thema der Stunde ein. Der eingetragene Klassenamewird von jetzt an wöchentlich wiederholt. Der Stundenplan muss also nur für die erste Schulwocheübertragen werden.Wird der Eintrag des Klassennames später geändert, wiederholt sich von da an die Änderung jede Woche.Soll der Eintrag nicht mehr wiederholt werden, wird er an der Stelle gelöscht (=String ""), wo er nicht mehr auftauchen soll.

source: Note that every change in the class entry has to be confirmed either by hitting enter or by leaving the entry (i.e. tab or mouse click into a different cell). This has technical reasons due to the dynamic design of the application.
de: Man beachte, dass jede Änderung am Klasseneintrag mit der Eingabtaste (=Enter)bestätigt werden muss. Alternativ wird der Eintrag auch gespeichert, wenn man ausder Zelle herausspringt (Tab oder Mausklick irgendwo anders hin).Das liegt am dynamischen Design der Anwendung und ist nicht wirklich anders möglich.

source: The first time a class is entered, the entry is shown in red colour. This is for quickly finding it again.
de: Wo die Klasse eingetragen wurde, erscheintder Eintrag in rot. So kann man diese Stelle später wieder leichter finden.

source: The classes appear in the sequence view at once. Note that "x" does not because it has a leading dot which means, it is not repeated.
de: Die Klassen tauchen in der Sequenz-Ansicht sofort auf. Man beachte,dass das für "x" nicht zutrifft. Der Punkt am Anfang bedeutet, dass dieser Eintragnur einmal vorkommen soll. Da es ihn deshalb nur einmal gibt, wird keine Sequenz angelegt.

source: Holidays and days off
de: Ferien und schulfreie Tage

source: If a day is a holiday or you get sick or you attend an advanced training, you can deactivate all lessons for this date. Simply uncheck the checkbox right of the date (at the top).
de: Im Falle von Ferien, Feiertagen, Krankeit oder Fortbildungen, können alle Stunden fürdiesen Tag ausgeschaltet werden. Dazu kann man den Tag mit Hilfe der Checkboxneben dem Datum ausschalten.

source: This can be undone.
de: Das kann man auch wieder rückgängig machen.

source: Exceptions, substitute lessons, shifting lessons
de: Ausnahmen, Vertretungsstunden, Stunden verschieben

source: Temporary class entries are created by a classname, which is preceeded by a dot. No leading spaces are allowed. An example for a temporary class entry is ".9c". Dot enties are used for shifting and substitute lessons. They are not repeated and do not affect repetition of the original entry.
de: Wird dem Klasseneintrag ein Punkt vorangestellt, so ist dieser Eintrag eine Ausnahme.Ein Beispiel für einen Ausnahmeeintrag wäre z.B. ".9c".Diese Punkt-Einträge werden zum Verschieben von Stunden oder Vertretungsstundenbenutzt. Sie wiederholen sich nicht und beenden auch nicht die Wiederholung des Eintrages,der normalerweise an diesem Ort stehen würde.

source: If a lesson is simply cancelled, use only a dot (".") as class entry.
de: Fällt eine Stunde einfach aus, verwendet man nur einen Punkt (".") als Klasseneintrag.

source: Dot entries are also shown in red.
de: Punkt-Einträge werden ebenfalls rot angezeigt.

source: The image above shows one day in regular order.
de: Das obere Bild zeigt einen Tag in seiner planmäßigen Reihenfolge.

source: Now the following happened:
de: Das folgende ist nun passiert:

source: The lesson in 12M is cancelled.
de: Die Stunde in der 12M fällt aus.

source: The lesson in 9c is shifted to the next day.
de: Die Stunde in der 9c wird auf den nächsten Tag verschoben.

source: The lessons in 7a und 10d are commuted.
de: Die Stunden in der 7a und 10d wurden getauscht.

source: Timetable
de: Stundenplan

source: Timetable imitates a classic calendar/planner for teachers.
de: Stundenplan bildet einen klassichen Lehrerkalender bzw. -planer nach.

source: The topic of the lesson is determined by the curricular sequence. If you shift the lesson, e.g. by adding a substitute lesson, the topic is moved automatically according to the order of the curricular sequence.
de: Das Thema der Stunde wird von der Sequenz bestimmt. Wird eine Stundeverschoben, verschiebt sich automatisch auch das Stundenthema.

source: In the sequence view, you can edit the topic and the chronological order. Every line is one topic. The list of topics is an ordinary text field, which means you can copy and paste to or from a textfile. The classes in the sequence view are created dynamically. You don't have to keep a list of your classes in the settings. Note that a classname which <em>only</em> appears as temperary entry in the timetable view (dot entry) will not show up in the sequence view.
de: In der Sequenz-Ansicht können die Stundenthemen und die Reihenfolge bearbeitet werden.Jede Zeile ist ein Stundenthema. Diese Liste ist ein normales Textfeld. Man kann alsoin oder aus einer Textdatei einfügen bzw. kopieren.Die Klassen der Sequenzen werden dynamisch aus der Stundenplan-Ansicht erzeugt.Es gibt also keine Liste-von-Klassen in irgendwelchen Einstellungsdialogen.Eine Klasse, die <em>ausschließlich</em> als Ausnahme (Punkt-Eintrag) existiert, tauchtin der Sequenz-Ansicht nicht auf.

source: Memos and the calendar
de: Erinnerungen und der Kalender

source: The star at the top of every day can be used for memos.
de: Der Stern am Anfang jedes Tages kann für Erinnungen verwendet werden.

source: It turns orange if a memo for this day exists.
de: Er wird orange angezeigt, wenn für diesen Tag eine Erinnerung besteht.

source: If you have to add a lot of appointments at once, the calendar view is useful. Here you can also edit the memos, which appear in the timetable view.
de: Sollen viele Termine auf einmal eingetragen werden, ist die Kalender-Ansicht praktisch.Die dort eingetragenen Erinnerungen tauchen dann in der Stundenplan-Ansicht auf.
